app/Controllers/PersonaController.php

    public function index()
    {
        $data['personas'] = $this->personaModel->findAll();
---
SELECT *
FROM `personas`

    public function store()
    {
        $rules = [
            'nombre' => 'required|min_length[3]|max_length[100]',
            'email' => 'required|valid_email',
            'telefono' => 'required|min_length[10]|max_length[15]',
        ];

        if (!$this->validate($rules)) {
            return view('personas/create', [
                'validation' => $this->validator,
            ]);
        }

        $this->personaModel->save([
            'nombre' => $this->request->getPost('nombre'),
            'email' => $this->request->getPost('email'),
            'telefono' => $this->request->getPost('telefono'),
        ]);
---
INSERT INTO `personas` (`nombre`, `email`, `telefono`) VALUES ('Arrache', 'Arrache@hotmail.es', '3921008678')

    public function edit($id)
    {
        $data['persona'] = $this->personaModel->find($id);
---
SELECT *
FROM `personas`
WHERE `personas`.`id` = '1'

    public function update($id)
    {
        $rules = [
            'nombre' => 'required|min_length[3]|max_length[100]',
            'email' => 'required|valid_email',
            'telefono' => 'required|min_length[10]|max_length[15]',
        ];

        if (!$this->validate($rules)) {
            return view('personas/edit', [
                'validation' => $this->validator,
                'persona' => $this->personaModel->find($id),
            ]);
        }

        $this->personaModel->update($id, [
            'nombre' => $this->request->getPost('nombre'),
            'email' => $this->request->getPost('email'),
            'telefono' => $this->request->getPost('telefono'),
        ]);
---
SELECT *
FROM `personas`
WHERE `personas`.`id` = '1'
UPDATE `personas` SET `nombre` = 'Miguel Gonzalez', `email` = 'miguel@gmail.com', `telefono` = '3311093274'
WHERE `personas`.`id` IN ('1')

    public function delete($id)
    {
        if (!$this->personaModel->find($id)) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Persona con ID $id no encontrada");
        }

        $this->personaModel->delete($id);
---
SELECT *
FROM `personas`
WHERE `personas`.`id` = '2'
DELETE FROM `personas`
WHERE `id` IN ('2')